In [52]:
pip install pandas

Requirement already satisfied: pandas in c:\users\piyus\anaconda3\lib\site-packages (2.2.2)
Requirement already satisfied: numpy>=1.26.0 in c:\users\piyus\anaconda3\lib\site-packages (from pandas) (1.26.4)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\piyus\anaconda3\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\piyus\anaconda3\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in c:\users\piyus\anaconda3\lib\site-packages (from pandas) (2023.3)
Requirement already satisfied: six>=1.5 in c:\users\piyus\anaconda3\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

In [54]:
import pandas as pd

In [57]:
# Series
# pandas series is a one dimensional array like object that can hold data type. It is similiar to column in a table.

import pandas as pd
data=[1,2,3,4,5]
series=pd.Series(data)
print("Series \n",series)

Series
 0    1
1    2
2    3
3    4
4    5
dtype: int64

In [61]:
# Create Series from Dictonary
data={'a':1,'b':2,'c':3}
series_dict=pd.Series(data)
print(series_dict)

a    1
b    2
c    3
dtype: int64

In [67]:
# Dataframe
# create a dataframe from a dict of list

data={
    'Name':['Piyush','Prem','Krishna'],
    'Age':[25,30,45],
    'City':['India','NewYork','Bharat']
}
df=pd.DataFrame(data)
print(df)
print(type(df))

      Name  Age     City
0   Piyush   25    India
1     Prem   30  NewYork
2  Krishna   45   Bharat
<class 'pandas.core.frame.DataFrame'>

In [64]:
# create a dataframe from a list of dict

data=[
    {'Name':'Piyush','Age':32,'City':'Banglore'},
    {'Name':'RAM','Age':32,'City':'Banglore'},
    {'Name':'HANUMAN','Age':32,'City':'Banglore'},
    {'Name':'LAxman','Age':32,'City':'Banglore'}
]
df=pd.DataFrame(data)
print(df)
print(type(df))

      Name  Age      City
0   Piyush   32  Banglore
1      RAM   32  Banglore
2  HANUMAN   32  Banglore
3   LAxman   32  Banglore
<class 'pandas.core.frame.DataFrame'>

In [69]:
# Acessing data from dataframe
df

      Name  Age     City
0   Piyush   25    India
1     Prem   30  NewYork
2  Krishna   45   Bharat

In [70]:
df['Name']

0     Piyush
1       Prem
2    Krishna
Name: Name, dtype: object

In [71]:
df.loc[0]

Name    Piyush
Age         25
City     India
Name: 0, dtype: object

In [72]:
df.iloc[0]

Name    Piyush
Age         25
City     India
Name: 0, dtype: object

In [76]:
# Acessing a specific element
df.at[2,'Age']

45

In [77]:
df.at[2,'Name']

'Krishna'

In [78]:
# Acess the element using iat
df.iat[2,2]

'Bharat'

In [79]:
df

      Name  Age     City
0   Piyush   25    India
1     Prem   30  NewYork
2  Krishna   45   Bharat

In [80]:

# dATA MANIPULATION USING DATAFRAME
df

      Name  Age     City
0   Piyush   25    India
1     Prem   30  NewYork
2  Krishna   45   Bharat

In [81]:
df['Salary']=[50000,60000,70000]
df

      Name  Age     City  Salary
0   Piyush   25    India   50000
1     Prem   30  NewYork   60000
2  Krishna   45   Bharat   70000

In [85]:
# Remove a column
df.drop('Salary',axis=1,inplace=True)  #inplace = permenent operation

In [86]:
df

      Name  Age     City
0   Piyush   25    India
1     Prem   30  NewYork
2  Krishna   45   Bharat

In [87]:
# Add age to the column
df['Age']=df['Age']+1 ##increment will by 1
df

      Name  Age     City
0   Piyush   26    India
1     Prem   31  NewYork
2  Krishna   46   Bharat

In [89]:
df.drop(0,inplace=True)

In [90]:
df

      Name  Age     City
1     Prem   31  NewYork
2  Krishna   46   Bharat

In [91]:
# Display the data types of each column
print("Data types:\n",df. dtypes)
# Describe the DataFrame
print("Statistica1 summary:\n",df. describe( ) )

Data types:
 Name    object
Age      int64
City    object
dtype: object
Statistica1 summary:
              Age
count   2.000000
mean   38.500000
std    10.606602
min    31.000000
25%    34.750000
50%    38.500000
75%    42.250000
max    46.000000